{"name": "Narrator", "speaker_age": "30-45", "speaker_sex": "Male", "desc": "A 30-45 year old male. His voice is a rich, rhythmic baritone with a texture like heavy velvet. He speaks with a deliberate, atmospheric pace, utilizing pregnant pauses to build suspense. His tone is observant and cool, carrying the weight of a seasoned observer of London's shadows."}
{"name": "Sherlock Holmes", "speaker_age": "30-40", "speaker_sex": "Male", "desc": "A 30-40 year old male. His voice is crisp, sharp, and highly intellectual with a metallic edge. His pacing is rapid and clipped, as if his speech is struggling to keep up with his lightning-fast deductions. He sounds detached and restless, yet vibrantly alive with predatory curiosity."}
{"name": "Dr. Watson", "speaker_age": "35-45", "speaker_sex": "Male", "desc": "A 35-45 year old male. His voice is warm, steady, and resonant, reflecting his military background and medical profession. His tone is empathetic and grounded, with a moderate, comforting pace. He provides the human, emotional counterpoint to Holmes's cold logic."}
{"name": "Lady Evelyn", "speaker_age": "20-30", "speaker_sex": "Female", "desc": "A 20-30 year old young female. Her voice is melodic and high-class, but currently fractured by intense terror. Her breathing is shallow and audible, her speech punctuated by small, involuntary gasps. She sounds physically exhausted and emotionally pushed to the brink of a breakdown."}
{"speaker": "Narrator", "text": "Rain lashed against the windows of 221B Baker Street in relentless, rhythmic bursts. Inside, the fire hissed as stray droplets found their way down the chimney, and the air smelled of old paper and tobacco."}
{"speaker": "Dr. Watson", "text": "Honestly, Sherlock, do put that violin down. It's a night fit for no one but the devil. Even the street lamps are drowning in this fog."}
{"speaker": "Sherlock Holmes", "text": "On the contrary, Watson. A night of such violence is a siren song for those in true despair. Those who are pushed to the edge don't wait for fair weather to seek a way out. Ah, hear that?"}
{"speaker": "Narrator", "text": "A sudden, heavy thud echoed from the street door, followed by the frantic, metallic jangle of the doorbell ringing three times in rapid succession."}
{"speaker": "Sherlock Holmes", "text": "Heavy, dragging footsteps... her boots are laden with the thick, red clay of Surrey. And that ring—she pulled the bell with the desperate strength of someone fleeing a ghost."}
{"speaker": "Lady Evelyn", "text": "Mr. Holmes! Oh, please... forgive me. I haven't slept for three nights. I'm not mad, I swear... but I heard him! I heard my father calling from the locked study!"}
{"speaker": "Dr. Watson", "text": "Good heavens, Madam! You're shivering. Come, sit by the hearth. Sherlock, catch her umbrella before the rug is ruined. She's white as a sheet."}
{"speaker": "Lady Evelyn", "text": "It's no use, Doctor. Ever since the funeral... every midnight... there's a sound of heavy chains dragging across the attic floor, and then... a low, animal growl."}
{"speaker": "Sherlock Holmes", "text": " Chains in the attic. Traditional, yet effective. But tell me, Lady Evelyn, why is there a distinct scent of gunpowder on your glove, and a faint bruise on your trigger finger?"}
{"speaker": "Lady Evelyn", "text": " You... you noticed? Yes. I tried to shoot into the darkness when the door creaked open. But a shadow... it simply reached out and took the gun from my hand."}
{"speaker": "Dr. Watson", "text": "Took the gun? Without a word? Sherlock, this isn't a haunting, it's a cold-blooded intrusion."}
{"speaker": "Sherlock Holmes", "text": "A shadow that disarms but does not kill. How remarkably civil. And the Surrey mud suggests a very long journey for a 'ghost'."}
{"speaker": "Sherlock Holmes", "text": "Watson, fetch your service revolver and your sturdiest coat. Lady Evelyn, pray lead the way. I believe it's time we met this 'undead' father of yours."}
{"speaker": "Narrator", "text": "Outside, a crack of thunder shook the floorboards. Holmes threw on his Inverness cape, his silhouette against the fire looking like a great, dark bird of prey ready for the hunt."}